In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
print(type(series))

<class 'pandas.core.series.Series'>

In [4]:
data2 = {'a':1,'b':2,'c':3}
series2 = pd.Series(data2)
print(series2)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [6]:
data = {
    'Name':['Krish','John','Darpan'],
    'Age':[25,20,30],
    'City':['Bangalore','New York','Kathmandu']
}
df = pd.DataFrame(data)

In [7]:
df

     Name  Age       City
0   Krish   25  Bangalore
1    John   20   New York
2  Darpan   30  Kathmandu

In [8]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
data = [
    {'Name':"Darpan",'Age':20,'City':"Kathmandu"},
    {'Name':"Mahesh",'Age':20,'City':"Pokhara"},
    {'Name':"Kushal",'Age':20,'City':"Butwal"}
]
df = pd.DataFrame(data)

In [13]:
print(type(df['Name']))

<class 'pandas.core.series.Series'>

In [14]:
df.loc[0]

Name       Darpan
Age            20
City    Kathmandu
Name: 0, dtype: object

In [15]:
df.iloc[0]

Name       Darpan
Age            20
City    Kathmandu
Name: 0, dtype: object

In [16]:
df.loc[0][0]

C:\Users\Dell\AppData\Local\Temp\ipykernel_7248\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Darpan'

In [17]:
df.iloc[0][0]

C:\Users\Dell\AppData\Local\Temp\ipykernel_7248\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Darpan'

In [18]:
df.iloc[0][1]

C:\Users\Dell\AppData\Local\Temp\ipykernel_7248\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

20

In [19]:
df

     Name  Age       City
0  Darpan   20  Kathmandu
1  Mahesh   20    Pokhara
2  Kushal   20     Butwal

In [20]:
df.at[2,'Age']

20

In [21]:
df.at[2,'City']

'Butwal'

In [23]:
df.iat[2,2]

'Butwal'

In [24]:
df["Salary"] = [10000,20000,30000]
df

     Name  Age       City  Salary
0  Darpan   20  Kathmandu   10000
1  Mahesh   20    Pokhara   20000
2  Kushal   20     Butwal   30000

In [25]:
df.drop('Salary',axis=1)

     Name  Age       City
0  Darpan   20  Kathmandu
1  Mahesh   20    Pokhara
2  Kushal   20     Butwal

In [26]:
df

     Name  Age       City  Salary
0  Darpan   20  Kathmandu   10000
1  Mahesh   20    Pokhara   20000
2  Kushal   20     Butwal   30000

In [27]:
df.drop('Salary')

KeyError: "['Salary'] not found in axis"

In [28]:
df.drop('Salary',axis=1,inplace=True)

In [29]:
df

     Name  Age       City
0  Darpan   20  Kathmandu
1  Mahesh   20    Pokhara
2  Kushal   20     Butwal

In [30]:
df['Age'] = df['Age']+1
df

     Name  Age       City
0  Darpan   21  Kathmandu
1  Mahesh   21    Pokhara
2  Kushal   21     Butwal

In [31]:
df.drop(0)

     Name  Age     City
1  Mahesh   21  Pokhara
2  Kushal   21   Butwal

In [32]:
df

     Name  Age       City
0  Darpan   21  Kathmandu
1  Mahesh   21    Pokhara
2  Kushal   21     Butwal

In [33]:
df.drop(0,inplace=True)

In [34]:
df

     Name  Age     City
1  Mahesh   21  Pokhara
2  Kushal   21   Butwal

In [35]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [37]:
df.describe()

        Age
count   2.0
mean   21.0
std     0.0
min    21.0
25%    21.0
50%    21.0
75%    21.0
max    21.0